In [1]:
import pandas as pd

In [4]:
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                              'Bank Client Name':['Tom','Goblin','Legit','Nakul'],
                              'Net Worth [rs]': [800000, 570000, 1000000, 700000],
                              'Years with Bank': [4, 7, 10, 15]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [rs]  Years with Bank
0             111              Tom          800000                4
1             222           Goblin          570000                7
2             333            Legit         1000000               10
3             444            Nakul          700000               15

In [5]:
type(bank_client_df)

pandas.core.frame.DataFrame

In [6]:
bank_client_df.head(2)

   Bank Client ID Bank Client Name  Net Worth [rs]  Years with Bank
0             111              Tom          800000                4
1             222           Goblin          570000                7

In [7]:
bank_client_df.tail(2)

   Bank Client ID Bank Client Name  Net Worth [rs]  Years with Bank
2             333            Legit         1000000               10
3             444            Nakul          700000               15

In [8]:
bank_client_df.shape

(4, 4)

In [9]:
bank_client_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Bank Client ID    4 non-null      int64
 1   Bank Client Name  4 non-null      object
 2   Net Worth [rs]    4 non-null      int64
 3   Years with Bank   4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [13]:
portfolio_df = pd.DataFrame({'Stock ticker Symbols': ['AAPL','AMZN','T'],
                             'price per share': [3500, 200, 40],
                             'no of shares':[30, 40, 90]})
portfolio_df

  Stock ticker Symbols  price per share  no of shares
0                 AAPL             3500            30
1                 AMZN              200            40
2                    T               40            90

In [14]:
portfolio_df['price per share']

0    3500
1     200
2      40
Name: price per share, dtype: int64

In [15]:
portfolio_df['no of shares']

0    30
1    40
2    90
Name: no of shares, dtype: int64

In [16]:
stocks_value = portfolio_df['price per share'] * portfolio_df['no of shares']
print(stocks_value)

0    105000
1      8000
2      3600
dtype: int64

In [17]:
stocks_value.sum()

np.int64(116600)

In [18]:
print('Total Portfolio Value = {}'.format(stocks_value.sum()))

Total Portfolio Value = 116600

In [20]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [21]:
house_prices_df = pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')

In [22]:
house_prices_df[0]

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [23]:
house_prices_df[1]

,Province,Average House Price,12 Month Change
0,British Columbia,"$736,000",+ 7.6 %
1,Ontario,"$594,000",– 3.2 %
2,Alberta,"$353,000",– 7.5 %
3,Quebec,"$340,000",+ 7.6 %
4,Manitoba,"$295,000",– 1.4 %
5,Saskatchewan,"$271,000",– 3.8 %
6,Nova Scotia,"$266,000",+ 3.5 %
7,Prince Edward Island,"$243,000",+ 3.0 %
8,Newfoundland / Labrador,"$236,000",– 1.6 %
9,New Brunswick,"$183,000",– 2.2 %
10,Canadian Average,"$488,000",– 1.3 %
11,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [28]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [29]:
bank_df.to_csv('sample_output_index.csv', index = True)

In [30]:
bank_df.to_csv('sample_output_noindex.csv', index = False)

In [31]:
bank_df.to_csv('sample_ouput_noindex.csv.gz', index = False, compression='gzip') #compressing

In [32]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [33]:
bank_df.set_index('First Name', inplace = True)
bank_df

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [34]:
bank_df.reset_index(inplace = True)
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [36]:
bank_df = pd.read_csv('bank_client_information.csv',index_col='First Name')
bank_df

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [37]:
bank_df.set_index('Last Name', inplace = True)
bank_df

                             Email Postal Code  Net Worth  Years with Bank
Last Name
Steve               bird@gmail.com     N94 3M0    5000.00                5
Small           nsmall@hotmail.com     N8S 14K   10000.00                6
Keller             azikez@gahew.mr     S1T 4E6    9072.02                7
Steve             chanel@gmail.com     N7T 3E6   11072.02               10
Noor              kate@hotmail.com     K8N 5H6    5000.00               22
Mo                 samer@gmail.com     J7H 3HY  100000.00               26
Ismail     heba.ismail@hotmail.com     K8Y 3M8   50000.00               11
Ahmed          Laila.a@hotmail.com     J8Y 3M0   20000.00                3
Patton              daafeja@boh.jm     M6U 5U7    2629.13                1
Moran            guutodi@bigwoc.kw     K2D 4M9    8626.96               13

In [38]:
bank_df.reset_index(inplace = True)
bank_df

  Last Name                    Email Postal Code  Net Worth  Years with Bank
0     Steve           bird@gmail.com     N94 3M0    5000.00                5
1     Small       nsmall@hotmail.com     N8S 14K   10000.00                6
2    Keller          azikez@gahew.mr     S1T 4E6    9072.02                7
3     Steve         chanel@gmail.com     N7T 3E6   11072.02               10
4      Noor         kate@hotmail.com     K8N 5H6    5000.00               22
5        Mo          samer@gmail.com     J7H 3HY  100000.00               26
6    Ismail  heba.ismail@hotmail.com     K8Y 3M8   50000.00               11
7     Ahmed      Laila.a@hotmail.com     J8Y 3M0   20000.00                3
8    Patton           daafeja@boh.jm     M6U 5U7    2629.13                1
9     Moran        guutodi@bigwoc.kw     K2D 4M9    8626.96               13

In [39]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [40]:
sample = bank_df['Email']
sample

0             bird@gmail.com
1         nsmall@hotmail.com
2            azikez@gahew.mr
3           chanel@gmail.com
4           kate@hotmail.com
5            samer@gmail.com
6    heba.ismail@hotmail.com
7        Laila.a@hotmail.com
8             daafeja@boh.jm
9          guutodi@bigwoc.kw
Name: Email, dtype: object

In [41]:
type(sample)

pandas.core.series.Series

In [42]:
bank_df.Email # not work if there are spaces in column

0             bird@gmail.com
1         nsmall@hotmail.com
2            azikez@gahew.mr
3           chanel@gmail.com
4           kate@hotmail.com
5            samer@gmail.com
6    heba.ismail@hotmail.com
7        Laila.a@hotmail.com
8             daafeja@boh.jm
9          guutodi@bigwoc.kw
Name: Email, dtype: object

In [43]:
bank_df['Net Worth']

0      5000.00
1     10000.00
2      9072.02
3     11072.02
4      5000.00
5    100000.00
6     50000.00
7     20000.00
8      2629.13
9      8626.96
Name: Net Worth, dtype: float64

In [44]:
sample = bank_df[['First Name','Net Worth']]
sample

  First Name  Net Worth
0      Bird     5000.00
1       Noah   10000.00
2       Nina    9072.02
3    Chanel    11072.02
4       Kate    5000.00
5      Samer  100000.00
6       Heba   50000.00
7      Laila   20000.00
8     Joseph    2629.13
9       Noah    8626.96

In [45]:
type(sample)

pandas.core.frame.DataFrame

In [46]:
my_selected_columns = ['First Name','Net Worth']
sample = bank_df[my_selected_columns]
sample

  First Name  Net Worth
0      Bird     5000.00
1       Noah   10000.00
2       Nina    9072.02
3    Chanel    11072.02
4       Kate    5000.00
5      Samer  100000.00
6       Heba   50000.00
7      Laila   20000.00
8     Joseph    2629.13
9       Noah    8626.96

In [47]:
bank_df[0:2]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.0,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.0,6

In [48]:
my_selected_columns = ['Net Worth','Years with Bank','Postal Code']
sample = bank_df[my_selected_columns]
sample

   Net Worth  Years with Bank Postal Code
0    5000.00                5     N94 3M0
1   10000.00                6     N8S 14K
2    9072.02                7     S1T 4E6
3   11072.02               10     N7T 3E6
4    5000.00               22     K8N 5H6
5  100000.00               26     J7H 3HY
6   50000.00               11     K8Y 3M8
7   20000.00                3     J8Y 3M0
8    2629.13                1     M6U 5U7
9    8626.96               13     K2D 4M9

In [49]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [50]:
bank_df['Age'] = [25, 26, 28, 30, 36, 22, 48, 55, 70, 68]
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Age
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,25
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,26
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,28
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,30
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,36
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,22
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,48
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,55
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,70
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,68

In [51]:
bank_df.insert(0,column = 'Credit Score', value=[680,700,750,699,550,600,750,500,520,510])
bank_df

,Credit Score,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Age
0,680,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,25
1,700,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,26
2,750,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,28
3,699,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,30
4,550,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,36
5,600,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,22
6,750,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,48
7,500,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,55
8,520,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,70
9,510,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,68

In [52]:
del bank_df['Email']
bank_df

,Credit Score,First Name,Last Name,Postal Code,Net Worth,Years with Bank,Age
0,680,Bird,Steve,N94 3M0,5000.00,5,25
1,700,Noah,Small,N8S 14K,10000.00,6,26
2,750,Nina,Keller,S1T 4E6,9072.02,7,28
3,699,Chanel,Steve,N7T 3E6,11072.02,10,30
4,550,Kate,Noor,K8N 5H6,5000.00,22,36
5,600,Samer,Mo,J7H 3HY,100000.00,26,22
6,750,Heba,Ismail,K8Y 3M8,50000.00,11,48
7,500,Laila,Ahmed,J8Y 3M0,20000.00,3,55
8,520,Joseph,Patton,M6U 5U7,2629.13,1,70
9,510,Noah,Moran,K2D 4M9,8626.96,13,68

In [53]:
bank_df.drop(labels = ['Last Name','Net Worth'],axis=1, inplace = True)
bank_df

   Credit Score First Name Postal Code  Years with Bank  Age
0           680      Bird      N94 3M0                5   25
1           700       Noah     N8S 14K                6   26
2           750       Nina     S1T 4E6                7   28
3           699    Chanel      N7T 3E6               10   30
4           550       Kate     K8N 5H6               22   36
5           600      Samer     J7H 3HY               26   22
6           750       Heba     K8Y 3M8               11   48
7           500      Laila     J8Y 3M0                3   55
8           520     Joseph     M6U 5U7                1   70
9           510       Noah     K2D 4M9               13   68

In [54]:
Years_with_bank = bank_df.pop('Years with Bank')
Years_with_bank

0     5
1     6
2     7
3    10
4    22
5    26
6    11
7     3
8     1
9    13
Name: Years with Bank, dtype: int64

In [55]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [57]:
bank_df['Has Mortgage']=[1,1,0,0,0,0,1,0,0,0]
bank_df['Mortgage value'] = [200000,130000,0,0,0,0,40000,0,0,0]
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Has Mortgage,Mortgage value
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,1,200000
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,1,130000
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,0,0
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,0,0
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,0,0
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,0,0
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,1,40000
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,0,0
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,0,0
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,0,0

In [58]:
bank_df = pd.read_csv('bank_client_information.csv', index_col = 'Last Name')
bank_df

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [59]:
bank_df.sort_index(inplace = True)
bank_df

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10

In [60]:
bank_df.loc['Small']

First Name                       Noah
Email              nsmall@hotmail.com
Postal Code                   N8S 14K
Net Worth                     10000.0
Years with Bank                     6
Name: Small, dtype: object

In [61]:
bank_df.loc['Steve']

          First Name             Email Postal Code  Net Worth  Years with Bank
Last Name
Steve          Bird     bird@gmail.com     N94 3M0    5000.00                5
Steve        Chanel   chanel@gmail.com     N7T 3E6   11072.02               10

In [63]:
bank_df.loc['Ahmed':'Small'] #label based indexing, the last label is also included

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6

In [64]:
bank_df.loc[:'Keller']

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7

In [65]:
bank_df.loc[['Keller','Steve','Mo']]

          First Name             Email Postal Code  Net Worth  Years with Bank
Last Name
Keller          Nina   azikez@gahew.mr     S1T 4E6    9072.02                7
Steve          Bird     bird@gmail.com     N94 3M0    5000.00                5
Steve        Chanel   chanel@gmail.com     N7T 3E6   11072.02               10
Mo             Samer   samer@gmail.com     J7H 3HY  100000.00               26

In [67]:
bank_df.sample(n = 5,axis=0) #random rows

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11

In [69]:
bank_df.sample(frac= 0.3,axis=0) #percentage

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11

In [70]:
bank_df = pd.read_csv('bank_client_information.csv', index_col = 'First Name')
bank_df

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [71]:
bank_df.sample(n = 2,axis = 0)

           Last Name            Email Postal Code  Net Worth  Years with Bank
First Name
Samer             Mo  samer@gmail.com     J7H 3HY  100000.00               26
Nina          Keller  azikez@gahew.mr     S1T 4E6    9072.02                7

In [72]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [73]:
bank_df.iloc[9]

First Name                      Noah
Last Name                      Moran
Email              guutodi@bigwoc.kw
Postal Code                  K2D 4M9
Net Worth                    8626.96
Years with Bank                   13
Name: 9, dtype: object

In [74]:
bank_df[2:5]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22

In [75]:
bank_df.iloc[:4]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10

In [76]:
bank_df.iloc[[2,4,9]]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [77]:
bank_df.iloc[4,0:3]

First Name                Kate
Last Name                 Noor
Email         kate@hotmail.com
Name: 4, dtype: object

In [80]:
bank_df.iloc[-2:]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [81]:
bank_df.iloc[8:]

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [82]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [83]:
bank_df['Net Worth'] = bank_df['Net Worth']+1000
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,6000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,11000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,10072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,12072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,6000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,101000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,51000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,21000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,3629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,9626.96,13

In [84]:
bank_df['Net Worth'] = bank_df['Net Worth'].add(1000)
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,7000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,12000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,11072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,13072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,7000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,102000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,52000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,22000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,4629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,10626.96,13

In [85]:
bank_df['Net Worth (Rs)'] = bank_df ['Net Worth'].mul(90)
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Net Worth (Rs)
0,Bird,Steve,bird@gmail.com,N94 3M0,7000.00,5,630000.0
1,Noah,Small,nsmall@hotmail.com,N8S 14K,12000.00,6,1080000.0
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,11072.02,7,996481.8
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,13072.02,10,1176481.8
4,Kate,Noor,kate@hotmail.com,K8N 5H6,7000.00,22,630000.0
5,Samer,Mo,samer@gmail.com,J7H 3HY,102000.00,26,9180000.0
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,52000.00,11,4680000.0
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,22000.00,3,1980000.0
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,4629.13,1,416621.7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,10626.96,13,956426.4

In [86]:
bank_df.iloc[4,2] = 'kate.noor@gmail.com'
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Net Worth (Rs)
0,Bird,Steve,bird@gmail.com,N94 3M0,7000.00,5,630000.0
1,Noah,Small,nsmall@hotmail.com,N8S 14K,12000.00,6,1080000.0
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,11072.02,7,996481.8
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,13072.02,10,1176481.8
4,Kate,Noor,kate.noor@gmail.com,K8N 5H6,7000.00,22,630000.0
5,Samer,Mo,samer@gmail.com,J7H 3HY,102000.00,26,9180000.0
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,52000.00,11,4680000.0
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,22000.00,3,1980000.0
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,4629.13,1,416621.7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,10626.96,13,956426.4

In [87]:
bank_df.iloc[[0,3],[4]]= [6000,15000]
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Net Worth (Rs)
0,Bird,Steve,bird@gmail.com,N94 3M0,6000.00,5,630000.0
1,Noah,Small,nsmall@hotmail.com,N8S 14K,12000.00,6,1080000.0
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,11072.02,7,996481.8
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,15000.00,10,1176481.8
4,Kate,Noor,kate.noor@gmail.com,K8N 5H6,7000.00,22,630000.0
5,Samer,Mo,samer@gmail.com,J7H 3HY,102000.00,26,9180000.0
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,52000.00,11,4680000.0
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,22000.00,3,1980000.0
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,4629.13,1,416621.7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,10626.96,13,956426.4

In [89]:
print(bank_df['Net Worth (Rs)'].sum())

21726011.7

In [91]:
print('Total Net Worth of all clients = Rs {}'.format(bank_df['Net Worth (Rs)'].sum()))

Total Net Worth of all clients = Rs 21726011.7

In [92]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [93]:
bank_df.sort_values(by = 'Years with Bank')

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26

In [94]:
bank_df.sort_values(by = 'Years with Bank', ascending = False, inplace = True) 
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [95]:
bank_df.sort_index(inplace = True) 
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [98]:
bank_df['Rank']=bank_df['Net Worth'].rank(ascending=True).astype('int')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Rank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,2
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,5
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,7
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,2
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,10
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,9
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,8
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,4

In [99]:
bank_df.sort_values(by = 'Net Worth')

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Rank
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,1
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,2
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,2
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,4
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,6
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,7
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,8
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,9
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,10

In [100]:
bank_df = pd.read_csv('bank_client_information.csv')
bank_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13